## Plan Result (stg_gaps2 - TerraformPlanApply)




<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.storage_account.azurerm_private_endpoint.this[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.storage_account.azurerm_private_endpoint.this[0] will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "hmctsgaps2stgsftp"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "jumpbox-nonprod-rg"
      + subnet_id                = "/subscriptions/b44eb479-9ae2-42e7-9c63-f3c599719b6f/resourceGroups/jumpbox-nonprod-rg/providers/Microsoft.Network/virtualNetworks/jumpbox-nonprod-vnet/subnets/gaps2-subnet"
      + tags                     = {
          + "application"  = "gaps2"
          + "builtFrom"    = "hmcts/gaps2-infrastructure"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "hmctsgaps2stgsftp"
          + private_connection_resource_id = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/gaps2-stg-rg/providers/Microsoft.Storage/storageAccounts/hmctsgaps2stgsftp"
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "blob",
            ]
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":9,"Program":"tfcmt","SHA1":"","Target":"stg_gaps2 - TerraformPlanApply","Vars":{}} -->